---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotMirrorWallPanel
source: html/ad4cf815-cff0-1d23-fb22-d28e2223db67.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotMirrorWallPanel Property

Cannot mirror wall panels.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMirrorWallPanel { get; }
```